In [1]:
try:
    file =open('new_file.csv', 'x')
    file.close()
except:
    print("the file is already there!")

In [2]:
import pandas as pd
df = pd.read_csv('new_file.csv')
df

   sn  name  age        add      phone
0   1   ram   34  kathmandu  987654312
1   2  maya   25     boudha  123456778
2   3  sita   30   chabahil    9876543

In [3]:
import pandas as pd
df = pd.read_csv('new_file.csv', nrows= 2)
df

   sn  name  age        add      phone
0   1   ram   34  kathmandu  987654312
1   2  maya   25     boudha  123456778

In [5]:
data = df[df['age']>30]
data.to_csv('new_age_data.csv')